X_WS_SOAP_Java/wsdl/wsimport/UniversalTimeHandler/UniversalTimeServiceSEI.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6 in JDK 6. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6 in JDK 6. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://universaltime.handler.ws.pg.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://universaltime.handler.ws.pg.com/" name="UniversalTimeServiceSEI">
<types>
<xsd:schema>
<xsd:import namespace="http://universaltime.handler.ws.pg.com/" schemaLocation="http://localhost:7710/style/universaltime?xsd=1"></xsd:import>
</xsd:schema>
</types>
<message name="getCurrentTime">
<part name="parameters" element="tns:getCurrentTime"></part>
</message>
<message name="getCurrentTimeResponse">
<part name="parameters" element="tns:getCurrentTimeResponse"></part>
</message>
<portType name="UniversalTimeService">
<operation name="getCurrentTime">
<input message="tns:getCurrentTime"></input>
<output message="tns:getCurrentTimeResponse"></output>
</operation>
</portType>
<binding name="UniversalTimeServiceImplPortBinding" type="tns:UniversalTimeService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
<operation name="getCurrentTime">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
</binding>
<service name="UniversalTimeServiceSEI">
<port name="UniversalTimeServiceImplPort" binding="tns:UniversalTimeServiceImplPortBinding">
<soap:address location="http://localhost:7710/style/universaltime"></soap:address>
</port>
</service>
</definitions>